prasooooon/CPL/STM32_Files_shared/main.c
    HAL_Delay(20);

    // set seesaw pins as inputs - buttons and JOY
    i2c_d[0] = 0x01;
    i2c_d[1] = 0x03;
    i2c_d[2] = (uint8_t)(TFTSHIELD_BUTTON_ALL >> 24);
    i2c_d[3] = (uint8_t)(TFTSHIELD_BUTTON_ALL >> 16);
    i2c_d[4] = (uint8_t)(TFTSHIELD_BUTTON_ALL >> 8);
    i2c_d[5] = (uint8_t)(TFTSHIELD_BUTTON_ALL);
    while(HAL_I2C_Master_Transmit(&I2cHandle, (uint16_t)TFTSHIELD_I2C_ADDR, i2c_d, 6, 1000) != HAL_OK) {
        if (HAL_I2C_GetError(&I2cHandle) != HAL_I2C_ERROR_AF) {
            Error_Handler();
        }
    }

    // set pin val to high, buttons are active in low level
    i2c_d[0] = 0x01;
    i2c_d[1] = 0x05;
    i2c_d[2] = (uint8_t)(TFTSHIELD_BUTTON_ALL >> 24);
    i2c_d[3] = (uint8_t)(TFTSHIELD_BUTTON_ALL >> 16);
    i2c_d[4] = (uint8_t)(TFTSHIELD_BUTTON_ALL >> 8);
    i2c_d[5] = (uint8_t)(TFTSHIELD_BUTTON_ALL);
    while(HAL_I2C_Master_Transmit(&I2cHandle, (uint16_t)TFTSHIELD_I2C_ADDR, i2c_d, 6, 1000) != HAL_OK) {
        if (HAL_I2C_GetError(&I2cHandle) != HAL_I2C_ERROR_AF) {
            Error_Handler();
        }
    }

    // enable internal PULLUPs
    i2c_d[0] = 0x01;
    i2c_d[1] = 0x0B;
    i2c_d[2] = (uint8_t)(TFTSHIELD_BUTTON_ALL >> 24);
    i2c_d[3] = (uint8_t)(TFTSHIELD_BUTTON_ALL >> 16);
    i2c_d[4] = (uint8_t)(TFTSHIELD_BUTTON_ALL >> 8);
    i2c_d[5] = (uint8_t)(TFTSHIELD_BUTTON_ALL);
    while(HAL_I2C_Master_Transmit(&I2cHandle, (uint16_t)TFTSHIELD_I2C_ADDR, i2c_d, 6, 1000) != HAL_OK) {
        if (HAL_I2C_GetError(&I2cHandle) != HAL_I2C_ERROR_AF) {
            Error_Handler();
        }
    }

}

void OutString(char *s)
{
    HAL_UART_Transmit( &hUART2, (uint8_t*)s, strlen(s), 5000);
}

#define TFTSHIELD_VERSION 2

/**
  * @brief  main function
  * @param  None
  * @retval None
  */

#define cBUF_SIZE 255

void main(void)
{
    // timer settings
    uint32_t uiTicks, uiSec;
    // display tmp variables
    uint32_t uiDispCentX, uiDispCentY;
    // joystick operation
    JOYState_TypeDef oJoyState;

    // serial port i/o and status
#define cREVC_MAX 8
    uint8_t chArr[cREVC_MAX];
    HAL_StatusTypeDef oRecvStatus;

    // data reception
    uint32_t uiSerRecv;

    //
    // initialization of variables
    uiSec = 0;
    uiSerRecv = 0;

    //
    // System init
    HAL_Init();
    // Configure the System clock to 84 MHz
    SystemClock_Config();
    // serial port
    initUSART();

#if (TFTSHIELD_VERSION == 2)
    /* I2C init, 100kHz, 7b addressing */
    i2c_init();

    LCD_IO_Init();
#endif

#ifndef test

#if (TFTSHIELD_VERSION == 1)
    if(TFT_ShieldDetect() == SHIELD_DETECTED) {

    (void)BSP_JOY_Init();

#elif (TFTSHIELD_VERSION == 2)
    if (TFT_V2_ShieldDetect() == SHIELD_DETECTED) {
        TFT_V2_ShiedInit();
#endif
        /* light the LED od TFTSHIELD presence */
        //LED1_On();

        /* Initialize the LCD */
//  BSP_LCD_Init();

    }
#endif

//  TFT_V2_ShiedInit();
//  BSP_LCD_Init();
    // Nucleo User LED init
//  BSP_LED_Init( LED2 );
    // and usage
//  BSP_LED_Off( LED2 );
//  HAL_Delay( 1000 );
//  BSP_LED_On( LED2 );
//  HAL_Delay( 1000 );
//  BSP_LED_Toggle( LED2 );

    // Nucleo user button init
//  BSP_PB_Init( BUTTON_USER, BUTTON_MODE_GPIO );

    // Adafruit joystick init
//  (void)BSP_JOY_Init();

    //
    // Adafruit LCD init
    BSP_LCD_Init();
    uiDispCentX = BSP_LCD_GetXSize()/2;
    uiDispCentY = BSP_LCD_GetYSize()/2;

    // some drawings
    BSP_LCD_Clear( LCD_COLOR_WHITE );
//    BSP_LCD_DrawLine( 10, 10, 128-10, 10 );
//    BSP_LCD_SetFont( &Font8 );
//    BSP_LCD_SetTextColor( LCD_COLOR_RED );
//    BSP_LCD_DisplayStringAtLine( 1, (uint8_t *)" Welcome to Nucleo!" );

    char btInputBuffer[cBUF_SIZE];
    int iItemsInBuffer = 0;
    while(1) // main loop
    {
        if ( ( oRecvStatus = HAL_UART_Receive(&hUART2, chArr, 1, 100) ) == HAL_OK )
        {
            if (chArr[0] == '\0')
                continue;

            btInputBuffer[iItemsInBuffer] = (char) chArr[0];
            iItemsInBuffer++ ;

            if (iItemsInBuffer >= 2 &&
                btInputBuffer[iItemsInBuffer - 2] == '\r'
                && btInputBuffer[iItemsInBuffer - 1] == '\n')
            {       // Command detected

                btInputBuffer[iItemsInBuffer - 2] = 0;
                iItemsInBuffer = 0;

                if (strstr(btInputBuffer, "*IDN?") != NULL)
                {
                    OutString("This program was written by Prasoon Dwivedi and is running on a Nucleo-F446RE.\r\n");
                    memset(btInputBuffer, '\0', cBUF_SIZE);
                }

                else if (strstr(btInputBuffer, "DRAW:") != NULL)
                {
                    int ret, colourNumber;
                    char *colour;
                    char *colourList[] = {"LCD_COLOR_BLACK",
                                          "LCD_COLOR_GREY",
                                          "LCD_COLOR_BLUE",
                                          "LCD_COLOR_RED",
                                          "LCD_COLOR_GREEN",
                                          "LCD_COLOR_CYAN",
                                          "LCD_COLOR_MAGENTA",
                                          "LCD_COLOR_YELLOW",
                                          "LCD_COLOR_WHITE"};

                    char *alignList[] = {"CENTER_MODE",
                                         "RIGHT_MODE",
                                         "LEFT_MODE"};
                    char *alignMode;

                    if (strstr(btInputBuffer, "DRAW:SETTEXTCOLOR") != NULL)
                    {
                        ret = sscanf(btInputBuffer, "DRAW:SETTEXTCOLOR %d", &colourNumber);
                        colour = colourList[colourNumber - 1];

                        BSP_LCD_SetTextColor( colour );
                    }
                    else if (strstr(btInputBuffer, "DRAW:CLEAR") != NULL)
                    {
                        ret = sscanf(btInputBuffer, "DRAW:CLEAR %d", &colourNumber);
                        colour = colourList[colourNumber - 1];

                        BSP_LCD_Clear( colour );
                    }
                    else if (strstr(btInputBuffer, "DRAW:PIXEL") != NULL)
                    {
                        int iX, iY;
                        ret = sscanf(btInputBuffer, "DRAW:PIXEL %d,%d,%d", &iX, &iY, &colourNumber);
                        colour = colourList[colourNumber - 1];

                        BSP_LCD_DrawPixel(iX, iY, colour);
                    }

                    else if (strstr(btInputBuffer, "DRAW:LINE") != NULL)
                    {
                        int iX1, iY1, iX2, iY2;
                        ret = sscanf(btInputBuffer, "DRAW:LINE %d,%d,%d,%d", &iX1, &iY1, &iX2, &iY2);

