prasooooon/CPL/STM32_Files_shared/main.c
                        BSP_LCD_DrawLine(iX1, iY1, iX2, iY2);
                    }

                    else if (strstr(btInputBuffer, "DRAW:LINE") != NULL)
                    {
                        uint16_t iX, iY, iRad;
                        ret = sscanf(btInputBuffer, "DRAW:CIRCLE %d,%d,%d", &iX, &iY, &iRad);

                        BSP_LCD_DrawCircle(iX, iY, iRad);
                    }

                    else if (strstr(btInputBuffer, "DRAW:SETFONT") != NULL)
                    {
                        int fontSize;
                        ret = sscanf(btInputBuffer, "DRAW:SETFONT %d", &fontSize);

                        if (fontSize == 8)
                        { BSP_LCD_SetFont( &Font8); }

                        else if (fontSize == 12)
                        { BSP_LCD_SetFont( &Font12); }

                        else if (fontSize == 16)
                        { BSP_LCD_SetFont( &Font16); }

                        else if (fontSize == 20)
                        { BSP_LCD_SetFont( &Font20); }

                        else if (fontSize == 24)
                        { BSP_LCD_SetFont( &Font24); }

                        // font isn't valid otherwise, so don't change it
                    }

                    else if (strstr(btInputBuffer, "DRAW:TEXT") != NULL)
                    {
                        uint16_t iX, iY;
                        char *stringToPrint;
//                        char *tempStringToPrint;

                        ret = sscanf(btInputBuffer, "DRAW:TEXT %d,%d,%s,%d", &iX, &iY, stringToPrint, &alignMode);

//                        int iCnt, comma, secondComma, thirdComma = 0;
//                        while (btInputBuffer[iCnt] != 0)
//                        {
//                            if (btInputBuffer[iCnt] == ',')
//                            {
//                                comma ++;
//
//                                if (comma == 3)
//                                {
//                                    secondComma = iCnt;
//                                }
//
//                                if (comma == 3)
//                                {
//                                    thirdComma = iCnt;
//                                }
//                            }
//                            iCnt ++;
//                        }
//                        strncpy(tempStringToPrint, btInputBuffer[secondComma + 1], thirdComma - secondComma + 1);
                        if (alignMode == 1) {
                            BSP_LCD_DisplayStringAt(iX, iY, (uint8_t *) stringToPrint, CENTER_MODE);
                        }
                        if (alignMode == 2) {
                            BSP_LCD_DisplayStringAt(iX, iY, (uint8_t *) stringToPrint, RIGHT_MODE);
                        }
                        if (alignMode == 3) {
                            BSP_LCD_DisplayStringAt(iX, iY, (uint8_t *) stringToPrint, LEFT_MODE);
                        }
                    }

                    memset(btInputBuffer, '\0', cBUF_SIZE);
                }

                else
                {
                    OutString ("Wrong command\r\n");
                }

                memset(btInputBuffer, '\0', cBUF_SIZE);
            }//END command detected

            if (iItemsInBuffer >= cBUF_SIZE) {
                iItemsInBuffer = 0;
            }
        }
        //
        // Joystick reading example
#if (TFTSHIELD_VERSION == 1)
        oJoyState = BSP_JOY_GetState();
#elif (TFTSHIELD_VERSION == 2)
        oJoyState = TFT_V2_Shield_JOY_GetState();
#endif

    } // END while(1)
} // END main